<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introduction" data-toc-modified-id="Introduction-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introduction</a></span></li><li><span><a href="#Installation" data-toc-modified-id="Installation-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Installation</a></span></li><li><span><a href="#Introduction-to-pandas-data-structures" data-toc-modified-id="Introduction-to-pandas-data-structures-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introduction to pandas data structures</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#Dataframes" data-toc-modified-id="Dataframes-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Dataframes</a></span><ul class="toc-item"><li><span><a href="#From-data-types" data-toc-modified-id="From-data-types-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>From data types</a></span></li><li><span><a href="#From-path" data-toc-modified-id="From-path-3.2.2"><span class="toc-item-num">3.2.2&nbsp;&nbsp;</span>From path</a></span></li><li><span><a href="#From-databases" data-toc-modified-id="From-databases-3.2.3"><span class="toc-item-num">3.2.3&nbsp;&nbsp;</span>From databases</a></span></li></ul></li></ul></li><li><span><a href="#Exploratory-analysis-of-a-dataframe" data-toc-modified-id="Exploratory-analysis-of-a-dataframe-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Exploratory analysis of a dataframe</a></span><ul class="toc-item"><li><span><a href="#Meta-information" data-toc-modified-id="Meta-information-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Meta information</a></span></li><li><span><a href="#Previsualization" data-toc-modified-id="Previsualization-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Previsualization</a></span></li><li><span><a href="#Order-a-dataframe" data-toc-modified-id="Order-a-dataframe-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Order a dataframe</a></span></li><li><span><a href="#NaN-values" data-toc-modified-id="NaN-values-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>NaN values</a></span></li><li><span><a href="#Basic-descriptive-statistics" data-toc-modified-id="Basic-descriptive-statistics-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Basic descriptive statistics</a></span></li></ul></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

# Pandas

![pandas](https://media.giphy.com/media/nVsLCrW5iHf6E/giphy.gif)

## Introduction
Pandas is undoubtedly the most widely used library in the Python ecosystem for data manipulation and analysis. It's fast, powerful, flexible, easy to use and open source.


Among its main features:

- A fast and efficient **DataFrame** object for data manipulation with built-in indexing* 

- **Reading and writing** of data in many formats: Microsoft Excel, CSV, SQL databases, etc;

- Integrated and efficient methods for all types of data manipulation: missing data, subset, union, merge, etc;

- Ease of working with temporary data (in fact, Pandas is named after "PANnel DAta")

- Good **integration with other data analysis or Machine learning libraries**: scikit-learn, scipy, seaborn, plotly, etc;

- It is **widely used** in both the private and academic sectors


Pandas provides high-level data structures and functions designed to make working with structured or tabular data fast, easy, and expressive. Since its introduction in 2010, it has helped make Python a powerful and productive data analysis environment. The main pandas objects that will be used in this book are the DataFrame, a column-oriented tabular data structure with row and column labels, and the Series, a labeled one-dimensional array object.

Pandas combines the high performance ideas of NumPy with the flexible data manipulation capabilities of spreadsheets and relational databases (such as SQL). It provides sophisticated indexing functionality to make it easy to reshape, slice and dice, perform aggregations, and select subsets of data.

![image](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)



Source: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

## Installation

The first thing you should do will always be
`pip install pandas`, `conda install pandas`

In [1]:
# anaconda
    # enviroments: ironhack
    #pandas
    
# miniconda
    # conda activate ironhack
    #pip install pandas

In [2]:
import pandas as pd
import numpy as np

## Introduction to pandas data structures
To get started with pandas, you'll need to get comfortable with its two working data structures: Series and DataFrame. Although they are not a universal solution to all problems, they provide a solid and easy-to-use foundation for most applications.

### Series
A Serie is a one-dimensional array object containing a sequence of values ​​(of NumPy-like types) and an associated array of data labels, called its index. The simplest Series is formed from a single array of data:

In [3]:
my_series = pd.Series([1, 2, 3, "a_string", 12, 5])

In [4]:
my_series

0           1
1           2
2           3
3    a_string
4          12
5           5
dtype: object

In [5]:
random_list = [1, 2, 3, "a_string", 12, 5]

In [6]:
random_list[3]

'a_string'

In [7]:
type(random_list)

list

In [8]:
type(my_series)

pandas.core.series.Series

In [9]:
my_series.values

array([1, 2, 3, 'a_string', 12, 5], dtype=object)

In [10]:
list(my_series.values)

[1, 2, 3, 'a_string', 12, 5]

In [11]:
my_series.index

RangeIndex(start=0, stop=6, step=1)

The string representation of a Series displayed interactively shows the index on the left and the values ​​on the right. Since we didn't specify an index for the data, a default one consisting of the integers 0 to N - 1 (where N is the length of the data) is created. You can get the array representation and the index object of the Series through its values ​​and index attributes, respectively:

Another way to think of a Series is as a fixed-length ordered dict, since it is a mapping of index values ​​to data values. It can be used in many contexts where a dictionary could be used.
If you have data contained in a Python dict, you can create a Series from it by passing the dict:

In [12]:
somedata = {
    "Ohio": 2000,
    "Texas":"2001",
    "Oregon":  79865,
    "Utah":4892383,
    "something else": "4984"
}

In [13]:
somedata

{'Ohio': 2000,
 'Texas': '2001',
 'Oregon': 79865,
 'Utah': 4892383,
 'something else': '4984'}

In [14]:
somedata.values()

dict_values([2000, '2001', 79865, 4892383, '4984'])

In [15]:
somedata.keys()

dict_keys(['Ohio', 'Texas', 'Oregon', 'Utah', 'something else'])

In [16]:
# Q: Capitalization of Series and DataFrame?
# A: needed
#pd.Series
#pd.DataFrame

In [17]:
somedata_series = pd.Series(somedata)
somedata_series

Ohio                 2000
Texas                2001
Oregon              79865
Utah              4892383
something else       4984
dtype: object

In [18]:
somedata_series.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah', 'something else'], dtype='object')

In [19]:
somedata_series.values

array([2000, '2001', 79865, 4892383, '4984'], dtype=object)

In [20]:
states = ["California", "Ohio", "Oregon", "Texas", "something else"]

In [21]:
somedata

{'Ohio': 2000,
 'Texas': '2001',
 'Oregon': 79865,
 'Utah': 4892383,
 'something else': '4984'}

In [22]:
somedata_series = pd.Series(somedata)
somedata_series

Ohio                 2000
Texas                2001
Oregon              79865
Utah              4892383
something else       4984
dtype: object

In [23]:
somedata_series = pd.Series(somedata, index = states)
somedata_series

California          NaN
Ohio               2000
Oregon            79865
Texas              2001
something else     4984
dtype: object

In [24]:
for i in somedata_series.values:
    print(type(i))

<class 'float'>
<class 'int'>
<class 'int'>
<class 'str'>
<class 'str'>

In [25]:
# NaN: missing value
# Not a number
# missing values -> are type float

In [26]:
# type float cannot do whatever you're trying to applay

When only one dict is passed, the resulting String index will have the keys of the dict in order. You can override this by passing the keys of the dict in the order you want them to appear in the resulting String:

Here, the three values ​​found in sdata were placed in the appropriate places, but since no value was found for 'California', it appears as NaN (not a number), which is considered in pandas to mark missing values ​​or NA. Since "Utah" was not included in the states, it is excluded from the resulting object.

In [27]:
somedata_series.index

Index(['California', 'Ohio', 'Oregon', 'Texas', 'something else'], dtype='object')

In [28]:
somedata_series.values

array([nan, 2000, 79865, '2001', '4984'], dtype=object)

### Dataframes
Pandas can read and write data from a wide variety of formats. [Read the documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Although one of the most common is from a dict of lists of equal length or NumPy arrays:

#### From data types

`from dictionaries with lists as values`

In [29]:
dictionary_with_lists = {
    "state": ["Ohio", "Texas", "Nevada", "Michigan"],
    "year": [19900, 28374, 3044, 50554],
    "something": [1.6, "THIS IS TEXAS", 3434, np.nan]
}

In [30]:
df = pd.DataFrame(dictionary_with_lists)
df

      state   year      something
0      Ohio  19900            1.6
1     Texas  28374  THIS IS TEXAS
2    Nevada   3044           3434
3  Michigan  50554            NaN

Since we are using Jupyter Notebook, pandas DataFrame objects will be displayed as a more browser-friendly HTML table. [More info on this](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html)

`from list of dictionaries`

If I create a dataframe through a list of dictionaries:
- Each dictionary will be a row
- The keys will be the names of the columns
- They have to have the same structure

In [31]:
list_of_dictionaries = [
        {"state":"Ohio", "year": 1900, "something": 1.6},
        {"state":"texas", "year": 3434, "something": 2},
        {"state":"nevada", "year": 3434, "something": "hello"},
        {"state":"michigan", "year": 1212, "something": 1.6}
        #{"esteit":"michigan", "year": 1212, "something": 1.6}

]

In [32]:
df = pd.DataFrame(list_of_dictionaries)
df

      state  year something
0      Ohio  1900       1.6
1     texas  3434         2
2    nevada  3434     hello
3  michigan  1212       1.6

[pandas from dict](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.from_dict.html)

#### From path

`.csv`

In [33]:
df = pd.read_csv("../datasets/Advertising.csv")
df

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [34]:
#csv: comma separated values

In [35]:
#csv, separator = ";"

`.xlsx`, `xls`, `xlsm`, `xlsb`, `odf`, `ods`, `odt`

In [36]:
#df_from_excel = pd.read_excel("../datasets/Online Retail.xlsx", engine="openpyxl", nrows=5)
#df_from_excel.head()

`Reading different sheeets`

In [37]:
# Default tab (first one)

#df_from_excel_new_tab = pd.read_excel("../datasets/Online Retail.xlsx", engine="openpyxl", nrows=5)
#df_from_excel_new_tab.head()

In [38]:
# Other tab: (new_tab)
#df_from_excel_new_tab = pd.read_excel("../datasets/Online Retail.xlsx", engine="openpyxl", "new_tab", nrows=5)
#df_from_excel_new_tab.head()

`web`: https://raw.githubusercontent.com/datapackage-examples/sample-csv/master/sample.csv

In [39]:
df = pd.read_csv("https://raw.githubusercontent.com/datapackage-examples/sample-csv/master/sample.csv")
df

,header 0,header 1,header 2,header 3,header 4,header 5,header 6,header 7,header 8,header 9
0,row 1 col 0,row 1 col 1,row 1 col 2,row 1 col 3,row 1 col 4,row 1 col 5,row 1 col 6,row 1 col 7,row 1 col 8,row 1 col 9
1,row 2 col 0,row 2 col 1,row 2 col 2,row 2 col 3,row 2 col 4,row 2 col 5,row 2 col 6,row 2 col 7,row 2 col 8,row 2 col 9
2,row 3 col 0,row 3 col 1,row 3 col 2,row 3 col 3,row 3 col 4,row 3 col 5,row 3 col 6,row 3 col 7,row 3 col 8,row 3 col 9
3,row 4 col 0,row 4 col 1,row 4 col 2,row 4 col 3,row 4 col 4,row 4 col 5,row 4 col 6,row 4 col 7,row 4 col 8,row 4 col 9
4,row 5 col 0,row 5 col 1,row 5 col 2,row 5 col 3,row 5 col 4,row 5 col 5,row 5 col 6,row 5 col 7,row 5 col 8,row 5 col 9
5,row 6 col 0,row 6 col 1,row 6 col 2,row 6 col 3,row 6 col 4,row 6 col 5,row 6 col 6,row 6 col 7,row 6 col 8,row 6 col 9
6,row 7 col 0,row 7 col 1,row 7 col 2,row 7 col 3,row 7 col 4,row 7 col 5,row 7 col 6,row 7 col 7,row 7 col 8,row 7 col 9
7,row 8 col 0,row 8 col 1,row 8 col 2,row 8 col 3,row 8 col 4,row 8 col 5,row 8 col 6,row 8 col 7,row 8 col 8,row 8 col 9
8,row 9 col 0,row 9 col 1,row 9 col 2,row 9 col 3,row 9 col 4,row 9 col 5,row 9 col 6,row 9 col 7,row 9 col 8,row 9 col 9
9,row 10 col 0,row 10 col 1,row 10 col 2,row 10 col 3,row 10 col 4,row 10 col 5,row 10 col 6,row 10 col 7,row 10 col 8,row 10 col 9

#### From databases

`sql`: [docs](https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html)

```python
from sqlite3 import connect

conn = connect(':memory:')
df = pd.read_sql('SELECT column_1, column_2 FROM sample_data', conn)

df.to_sql('test_data', conn)
```

`mongodb`

```python
import pymongo
from pymongo import MongoClient

client = MongoClient()
db = client.database_name
collection = db.collection_name
data = pd.DataFrame(list(collection.find()))
```

## Exploratory analysis of a dataframe

In [40]:
df = pd.read_csv("../datasets/Advertising.csv")
df

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

### Meta information

`shape, columns, dtypes, info, describe`

In [41]:
"""
class DataFrame ():
    def __init__ (self, data):
        self.shape = shape
        self.columns = []
"""

'\nclass DataFrame ():\n    def __init__ (self, data):\n        self.shape = shape\n        self.columns = []\n'

In [42]:
df.shape

(200, 4)

In [43]:
df.columns

Index(['TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

In [44]:
list(df.columns)

['TV', 'Radio', 'Newspaper', 'Sales']

In [45]:
df.dtypes

TV           float64
Radio        float64
Newspaper    float64
Sales        float64
dtype: object

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   Radio      200 non-null    float64
 2   Newspaper  200 non-null    float64
 3   Sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [47]:
df.describe() # Generate descriptive statistics

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

[How dtypes work](https://numpy.org/doc/stable/reference/arrays.dtypes.html)

### Previsualization

`head`

In [48]:
# bash: head & tail

In [49]:
df.head()

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

By default head shows me the first 5 rows, I can see some more or less by passing a number as a parameter

In [50]:
df.head(8)

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9
5    8.7   48.9       75.0    7.2
6   57.5   32.8       23.5   11.8
7  120.2   19.6       11.6   13.2

`tail`

In [51]:
df.tail()

        TV  Radio  Newspaper  Sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

### Order a dataframe

In [52]:
df = pd.read_csv("../datasets/avocado_kaggle.csv")

In [53]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
5647,31,2017-05-28,1.8,121869.11,2345.65,106690.16,105.74,12727.56,6141.75,6029.14,556.67,conventional,2017,Albany

In [54]:
df.sort_values(by=["year", "type"], ascending=False) # with two args

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
17601,0,2018-03-25,1.71,2321.82,42.95,272.41,0.00,2006.46,1996.46,10.00,0.0,organic,2018,Albany
17602,1,2018-03-18,1.66,3154.45,275.89,297.96,0.00,2580.60,2577.27,3.33,0.0,organic,2018,Albany
17603,2,2018-03-11,1.68,2570.52,131.67,229.56,0.00,2209.29,2209.29,0.00,0.0,organic,2018,Albany
17604,3,2018-03-04,1.48,3851.30,311.55,296.77,0.00,3242.98,3239.65,3.33,0.0,organic,2018,Albany
17605,4,2018-02-25,1.56,5356.63,816.56,532.59,0.00,4007.48,4007.48,0.00,0.0,organic,2018,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2803,47,2015-02-01,0.71,916367.42,611270.39,205181.23,14107.36,85808.44,82065.70,3742.74,0.0,conventional,2015,WestTexNewMexico
2804,48,2015-01-25,0.80,720800.61,519142.82,124248.86,10573.29,66835.64,65072.69,1762.95,0.0,conventional,2015,WestTexNewMexico
2805,49,2015-01-18,0.80,729795.72,516446.41,128438.87,12473.14,72437.30,71564.22,873.08,0.0,conventional,2015,WestTexNewMexico
2806,50,2015-01-11,0.92,584896.99,347125.63,129717.42,27944.07,80109.87,78503.46,1606.41,0.0,conventional,2015,WestTexNewMexico
2807,51,2015-01-04,0.75,758118.95,426878.87,147958.43,15267.89,168013.76,165202.22,2811.54,0.0,conventional,2015,WestTexNewMexico

Same operation, but give me only concrete columns

In [55]:
df.sort_values(by=["year", "type"], ascending=False)[["year", "region"]]
#df[["year_2", "region"]]

       year            region
17601  2018            Albany
17602  2018            Albany
17603  2018            Albany
17604  2018            Albany
17605  2018            Albany
...     ...               ...
2803   2015  WestTexNewMexico
2804   2015  WestTexNewMexico
2805   2015  WestTexNewMexico
2806   2015  WestTexNewMexico
2807   2015  WestTexNewMexico

[18249 rows x 2 columns]

`sample`

In [56]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
9385,51,2015-01-04,1.83,2192.13,8.66,939.43,0.0,1244.04,1244.04,0.0,0.0,organic,2015,Boston

In [57]:
df.sample(frac=0.01) # %

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
15493,10,2017-10-22,1.32,9171.48,15.63,686.14,0.00,8469.71,8469.71,0.00,0.00,organic,2017,GrandRapids
17883,6,2018-02-11,1.56,2174.66,6.00,883.15,0.00,1285.51,1027.05,258.46,0.00,organic,2018,Louisville
8032,31,2017-05-28,0.96,6549043.84,3495036.65,1267551.42,27015.73,1759440.04,1322192.06,405650.84,31597.14,conventional,2017,SouthCentral
795,15,2015-09-13,1.03,3532480.92,492741.15,1958150.00,447108.50,634481.27,448051.74,132685.58,53743.95,conventional,2015,GreatLakes
8024,23,2017-07-23,1.05,5550586.51,2881726.68,1185462.48,16702.54,1466694.81,1013213.46,427812.72,25668.63,conventional,2017,SouthCentral
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16069,3,2017-12-10,1.61,140885.30,3274.32,33387.67,675.89,103547.42,97646.59,5900.83,0.00,organic,2017,Midsouth
8648,2,2018-03-11,1.43,191286.89,3195.61,75173.54,55327.24,57590.50,32676.64,8368.93,16544.93,conventional,2018,GrandRapids
7070,23,2017-07-23,1.39,262774.91,155838.78,38067.91,78.00,68790.22,49217.00,12526.55,7046.67,conventional,2017,NewOrleansMobile
2603,3,2015-12-06,1.17,227131.21,145404.19,29926.02,43.83,51757.17,33251.65,18505.52,0.00,conventional,2015,Tampa
18099,6,2018-02-11,1.88,18517.54,1101.05,8243.72,0.00,9172.77,9172.77,0.00,0.00,organic,2018,SanDiego

In [58]:
df.sample(5)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
7189,36,2017-04-23,1.59,3846196.30,244168.62,2440599.66,12331.97,1149096.05,892014.05,250892.40,6189.6,conventional,2017,Northeast
13113,36,2016-04-17,1.01,106228.91,10528.54,24399.57,0.00,71300.80,70842.07,458.73,0.0,organic,2016,LosAngeles
6496,32,2017-05-21,1.51,244638.89,52736.28,119601.86,179.49,72121.26,70371.47,1749.79,0.0,conventional,2017,HarrisburgScranton
4250,38,2016-04-03,0.89,316709.44,183584.86,29117.49,4574.45,99432.64,80521.66,18910.98,0.0,conventional,2016,NewOrleansMobile
4115,7,2016-11-06,1.54,2077507.41,569735.76,697011.92,122472.40,688287.33,588028.35,99508.98,750.0,conventional,2016,Midsouth

In [59]:
df.sample(n=5)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
16508,18,2017-08-27,2.00,16505.49,5358.19,2591.23,0.00,8556.07,8501.90,54.17,0.00,organic,2017,PhoenixTucson
8098,44,2017-02-26,1.09,3780081.91,2009302.02,536981.39,6635.90,1227162.60,876737.08,337642.19,12783.33,conventional,2017,Southeast
4380,12,2016-10-02,1.52,291185.37,18423.35,222357.93,3193.18,47210.91,47207.35,3.56,0.00,conventional,2016,NorthernNewEngland
4208,48,2016-01-24,0.87,167159.24,78105.34,33125.00,6297.48,49631.42,25723.50,23907.92,0.00,conventional,2016,Nashville
13740,39,2016-03-27,1.18,1702.84,96.59,220.18,26.36,1359.71,1356.26,3.45,0.00,organic,2016,Pittsburgh

`display`

In [60]:
display(df)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

### NaN values
NaN stands for Not A Number and is one of the common ways to represent the missing value in the data. It is a special floating point value and cannot be converted to a type other than float.
The NaN value is one of the main problems in data analysis. It is very essential to deal with NaN to get the desired results.

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    18249 non-null  int64
 1   Date          18249 non-null  object
 2   AveragePrice  18249 non-null  float64
 3   Total Volume  18249 non-null  float64
 4   4046          18249 non-null  float64
 5   4225          18249 non-null  float64
 6   4770          18249 non-null  float64
 7   Total Bags    18249 non-null  float64
 8   Small Bags    18249 non-null  float64
 9   Large Bags    18249 non-null  float64
 10  XLarge Bags   18249 non-null  float64
 11  type          18249 non-null  object
 12  year          18249 non-null  int64
 13  region        18249 non-null  object
dtypes: float64(9), int64(2), object(3)
memory usage: 1.9+ MB

In [62]:
pd.isnull(df).sum() # If Null -> it's True -> sum() a True, the result will be 1

Unnamed: 0      0
Date            0
AveragePrice    0
Total Volume    0
4046            0
4225            0
4770            0
Total Bags      0
Small Bags      0
Large Bags      0
XLarge Bags     0
type            0
year            0
region          0
dtype: int64

In [63]:
pd.isna(df).sum() #same method

Unnamed: 0      0
Date            0
AveragePrice    0
Total Volume    0
4046            0
4225            0
4770            0
Total Bags      0
Small Bags      0
Large Bags      0
XLarge Bags     0
type            0
year            0
region          0
dtype: int64

###  Basic descriptive statistics

In [64]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
10406,32,2015-05-17,1.79,2141.08,1251.61,48.24,0.0,841.23,827.49,13.74,0.0,organic,2015,MiamiFtLauderdale

In [65]:
df.AveragePrice.value_counts() #dot notation: capital letter

1.15    202
1.18    199
1.08    194
1.26    193
1.13    192
       ...
3.05      1
3.03      1
2.91      1
0.48      1
2.96      1
Name: AveragePrice, Length: 259, dtype: int64

In [66]:
df["AveragePrice"].value_counts() #

1.15    202
1.18    199
1.08    194
1.26    193
1.13    192
       ...
3.05      1
3.03      1
2.91      1
0.48      1
2.96      1
Name: AveragePrice, Length: 259, dtype: int64

In [67]:
dict_ = {
    "age": 30
}

In [68]:
#dict_["AveragePrice"] #key error

In [69]:
#df[" AveragePrice "] #key error

In [70]:
df.AveragePrice

0        1.33
1        1.35
2        0.93
3        1.08
4        1.28
         ...
18244    1.63
18245    1.71
18246    1.87
18247    1.93
18248    1.62
Name: AveragePrice, Length: 18249, dtype: float64

In [71]:
df["AveragePrice"].min()

0.44

In [72]:
df["AveragePrice"].max()

3.25

In [73]:
df["AveragePrice"].std()

0.40267655549555004

In [74]:
df.AveragePrice.mean()

1.4059784097758825

In [75]:
#np.array.max()
#pd.Series.max()

## Pandas usual methods
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values ​​of a column
df.col.unique() # returns unique values ​​from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)